Revit 2026 API

# RebarCrankOverridableParameters Class

---

Class used to store the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters.

SystemObject Autodesk.Revit.DB.StructureRebarCrankOverridableParameters

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarCrankOverridableParameters : IDisposable
```
```vb
Public Class RebarCrankOverridableParameters
	Implements IDisposable
```
```cpp
public ref class RebarCrankOverridableParameters : IDisposable
```
```fsharp
type RebarCrankOverridableParameters =
    class
        interface IDisposable
    end
```

The RebarCrankOverridableParameters type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarCrankOverridableParameters |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCrankEndAngledLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with end crank angled length parameters. |
|  | GetCrankEndLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with end crank length parameters. |
|  | GetCrankEndOffsetLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with end crank offset length parameters. |
|  | GetCrankEndRatioFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with end crank ratio parameters. |
|  | GetCrankEndStraightLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with end crank straight length parameters. |
|  | GetCrankStartAngledLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with start crank angled length parameters. |
|  | GetCrankStartLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with start crank length parameters. |
|  | GetCrankStartOffsetLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with start crank offset length parameters. |
|  | GetCrankStartRatioFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with start crank ratio parameters. |
|  | GetCrankStartStraightLengthFormulaParams | Gets the formula parameter ids defined in the RebarShape family which are associated with start crank straight length parameters. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Structure Namespace